#1. 
# Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число.
# ['ssss', 'sngujn556', 56] -> Yes
# ['56', 'sgnbsb'] -> No

list = [1, 2, 3, "meow"]  
list.isdigit()   
print(list)