# 3'. 
# Задайте список из вещественных чисел. 
# Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# *Пример:*

# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# Разница между максимальным и минимальным 

list = [1.1,1.2,3.1,5,10.01]
res = 0
max(list)
min(list)
res = max(list)-min(list)
print(res)
